front-end/app/Controllers/BookingController.php

    public function book($id_kamar)
    {
        // if (!session()->get('isLoggedIn')) {
        //     // Set flashdata untuk menampilkan alert
        //     session()->setFlashdata('error', 'Silahkan login terlebih dahulu untuk melakukan booking.');
        //     return redirect()->to('/login');
        // }

        $kamar = $this->KamarModel->find($id_kamar);
---
SELECT *
FROM `kamar`
WHERE `kamar`.`id` = '2'