front-end/app/Controllers/KamarController.php

    public function index()
    {

        $kamar = $this->KamarModel->findAll();
---
SELECT *
FROM `kamar`

    public function detailkamar($id)
    {
        $kamar = $this->KamarModel->find($id);
        $fasilitasIds = $this->KamarFasilitasModel->where ('id_kamar', $id)->findAll();
        $fasilitas = array_map(function($f) {
            return $this->FasilitasModel->find($f ['id_fasilitas']);
---
SELECT *
FROM `kamar`
WHERE `kamar`.`id` = '2'
SELECT *
FROM `kamar_fasilitas`
WHERE `id_kamar` = '2'
SELECT *
FROM `fasilitas`
WHERE `fasilitas`.`id` = '1'